#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <locale>

//Лабораторная 1
void Lab1();
void S();

//Лабораторная 2
void find_len();
void Bad_function();

//Лабораторная 3
void Lab3_calculator();
void Lab3_main_task();

//Лабораторная 4
void list_characters();
void funk();

//Лабораторная 5
int randint(int min, int max);
void sortedList();
void Lab5();

//Лабораторная 6
void Lab6();
void findTheeWords();


int main()
{
    setlocale(0, "");
    srand((unsigned)time(0));
    //Лабораторная 1
    //Lab1();
    //S();

    //Лабораторная 2
    //find_len();
    //Bad_function();

    //Лабораторная 3
    //Lab3_calculator();
    //Lab3_main_task();

    //Лабораторная 4
    //list_characters();
    //funk();

    //Лабораторная 5
    //printf("%i", randint(5, 20));
    //sortedList();
    //Lab5();

    //Лабораторная 6
    Lab6();
    //findTheeWords();

    return 1;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
